In [1]:
import pandas as pd

In [2]:
dict1 = {'Name':['Priyang','Aadhya','krishna','Vedant','parshav','Mittal','Archana'], \
         'Marks':[98,89,99,87,90,83,99], \
        'Gender':['Male','Female','Female','Male','Male','Female','Female']}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  krishna     99  Female
3   Vedant     87    Male
4  parshav     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [5]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  krishna     99  Female

In [6]:
df.tail(3)

      Name  Marks  Gender
4  parshav     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [7]:
a =df.shape
a

(7, 3)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [9]:
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [10]:
print(f'Number of rows {a[0]}')

Number of rows 7

In [11]:
df.isnull().sum(axis =1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [12]:
df.nunique()

Name      7
Marks     6
Gender    2
dtype: int64

In [13]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [14]:
df.value_counts(['Name'])

Name
Aadhya     1
Archana    1
Mittal     1
Priyang    1
Vedant     1
krishna    1
parshav    1
dtype: int64

In [15]:
len(df[(df['Marks'] >=90) & (df['Marks'] <= 100)])

4

In [16]:
len(df[df['Marks'].between(90,100)])

4

In [17]:
round(df['Marks'].mean(),3)

92.143

In [18]:
def marks(x):
    return x//2

In [19]:
df['marks1'] = df['Marks'].apply(marks)

In [20]:
df

      Name  Marks  Gender  marks1
0  Priyang     98    Male      49
1   Aadhya     89  Female      44
2  krishna     99  Female      49
3   Vedant     87    Male      43
4  parshav     90    Male      45
5   Mittal     83  Female      41
6  Archana     99  Female      49

In [21]:
df['Marks1']=df['Marks'].apply(lambda x:x//2)

In [22]:
df['Gender1']=df['Gender'].map({'Male':1,'Female':0})

In [23]:
df

      Name  Marks  Gender  marks1  Marks1  Gender1
0  Priyang     98    Male      49      49        1
1   Aadhya     89  Female      44      44        0
2  krishna     99  Female      49      49        0
3   Vedant     87    Male      43      43        1
4  parshav     90    Male      45      45        1
5   Mittal     83  Female      41      41        0
6  Archana     99  Female      49      49        0

In [24]:
df.drop(['marks1','Marks1','Gender1'],axis = 1, inplace = True)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  krishna     99  Female
3   Vedant     87    Male
4  parshav     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [25]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [26]:
df.sort_values(by = ['Marks','Gender'],ascending = False)

      Name  Marks  Gender
2  krishna     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4  parshav     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [27]:
df[df['Gender'] == 'Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2  krishna     99
5   Mittal     83
6  Archana     99

In [28]:
df[df['Gender'].isin(['Female'])]

      Name  Marks  Gender
1   Aadhya     89  Female
2  krishna     99  Female
5   Mittal     83  Female
6  Archana     99  Female